In [2]:
import pandas as pd
import numpy as np
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [4]:
# 21.For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages
# hint : use a pivot table.
df = pd.DataFrame(data, index = labels)
df.pivot_table(index = 'animal', columns = 'visits', values = 'age', aggfunc= 'mean')

visits    1    2    3
animal
cat     2.5  NaN  2.5
dog     3.0  6.0  NaN
snake   4.5  0.5  NaN

In [22]:
# 22.You have a DataFrame df with a column 'A' of integers. For example:
# How do you filter out rows  which contain the same integer as the row immediately above?
# You should be left with a column containing the following values:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
# 1
print(df.drop_duplicates())

# 2 
df.loc[df['A'].shift() != df['A']] # i don't know...

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [26]:
# 23.Given a DataFrame of numeric values, say 
df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values

# how do you subtract the row mean from each element in the row?

df.sub(df.sum( axis = 1), axis = 0 )

          0         1         2
0 -1.170198 -1.004285 -0.303226
1 -1.751588 -1.541952 -1.762075
2 -0.741364 -1.271377 -0.532945
3 -0.106739 -0.845628 -0.935347
4 -1.212200 -0.977025 -0.885995

In [51]:
# 24.Suppose you have DataFrame with 10 columns of real numbers, for example:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
# which columns of numbers has the smallest sum? Return that column's label.

# 1
print(df.sum().sort_values().index[0])

# 2
print(df.sum().idxmin())

g
g

In [57]:
# 25.How do you count how many unique rows a DataFrame has ( i.e. ignore all rows that are duplicates)?

df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
# 1
df.drop_duplicates()

# 2

   0  1  2
0  0  1  1
1  1  1  0
3  1  0  0
5  0  1  0
6  1  1  1

In [58]:
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))

In [64]:
len(df) - df.drop_duplicates().sum()

0    7
1    7
2    6
dtype: int64

In [65]:
df.drop_duplicates(keep = False)

   0  1  2
0  1  0  1
2  0  1  1
5  0  0  1

In [12]:
# 26. In the cell below, you have a DataFrame df that consists of 10 columns of floating-point numbers. Exactly 5 entries in each row are NaN values.
# For each row of the DataFrame, find the column which contains the third NaN value.
# You should return a Series of column labels: e, c, d, h, d

import numpy as np
import pandas as pd
nan = np.nan

data = [[0.04,  nan,  nan, 0.25,  nan, 0.43, 0.71, 0.51,  nan,  nan],
        [ nan,  nan,  nan, 0.04, 0.76,  nan,  nan, 0.67, 0.76, 0.16],
        [ nan,  nan, 0.5 ,  nan, 0.31, 0.4 ,  nan,  nan, 0.24, 0.01],
        [0.49,  nan,  nan, 0.62, 0.73, 0.26, 0.85,  nan,  nan,  nan],
        [ nan,  nan, 0.41,  nan, 0.05,  nan, 0.61,  nan, 0.48, 0.68]]

columns = list('abcdefghij')

df = pd.DataFrame(data, columns=columns)
df
# write a solution to the question here

      a   b     c     d     e     f     g     h     i     j
0  0.04 NaN   NaN  0.25   NaN  0.43  0.71  0.51   NaN   NaN
1   NaN NaN   NaN  0.04  0.76   NaN   NaN  0.67  0.76  0.16
2   NaN NaN  0.50   NaN  0.31  0.40   NaN   NaN  0.24  0.01
3  0.49 NaN   NaN  0.62  0.73  0.26  0.85   NaN   NaN   NaN
4   NaN NaN  0.41   NaN  0.05   NaN  0.61   NaN  0.48  0.68

In [11]:
(df.isnull().cumsum(axis = 1) == 3).idxmax(axis = 1)

0    e
1    c
2    d
3    h
4    d
dtype: object

In [31]:
# 27. A DataFrame has a column of groups 'grps' and and column of integer values 'vals':
# For each group, find the sum of the three greatest values. You should end up with the answer as follows:

df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

df.groupby('grps')['vals'].nlargest(3).sum( level = 0) # multi index level,

grps
a    409
b    156
c    345
Name: vals, dtype: int64

In [44]:
df = pd.DataFrame(np.random.RandomState(8765).randint(1, 101, size=(100, 2)), columns = ["A", "B"])

# 28. The DataFrame df constructed below has two integer columns 'A' and 'B'. The values in 'A' are between 1 and 100 (inclusive).
# For each group of 10 consecutive integers in 'A' (i.e. (0, 10], (10, 20], ...), calculate the sum of the corresponding values in column 'B'.
# The answer should be a Series as follows:

df.groupby(pd.cut(df['A'], bins = np.arange(0, 101, 10 )))['B'].sum() # using cut

A
(0, 10]      635
(10, 20]     360
(20, 30]     315
(30, 40]     306
(40, 50]     750
(50, 60]     284
(60, 70]     424
(70, 80]     526
(80, 90]     835
(90, 100]    852
Name: B, dtype: int32

In [45]:
# 29. Consider a DataFrame df where there is an integer column 'X':
# For each value, count the difference back to the previous zero (or the start of the Series, whichever is closer). These values should therefore be
# [1, 2, 0, 1, 2, 3, 4, 0, 1, 2]
# Make this a new column 'Y'.

df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})